from flask import Flask, render_template
app = Flask(__name__, template_folder='./home', static_folder='./images')
@app.route('/image/<path:image_path>')
def image_description(image_path):
    # Загальний опис зображення (можна витягнути з бази даних або іншого джерела)
    image_descriptions = {
        "image1.jpg": "Опис першого зображення",
        "image2.jpg": "Опис другого зображення",
        "image3.jpg": "Опис третього зображення"
        # Додайте інші описи зображень, які ви хочете відобразити
    }

    # Перевіряємо, чи є опис для даного шляху зображення
    if image_path in image_descriptions:
        description = image_descriptions[image_path]
    else:
        description = "Опис відсутній"

    return render_template('image_description.html', image_path=image_path, description=description)
# Головна сторінка
@app.route('/')
def index():
    return render_template('index.html')

@app.route('/space-explorers')
def spaceexplorers():
    exploress_list = [
    {
    'id': 1,
    'name': 'Леонід Костянтинович Каденюк',
    'birthdate': '28 січня 1951',
    'birthplace': 'Клішківці, Чернівецька область, Українська',
    'deathdate': '31 січня 2018',
    'deathplace': 'Київ, Україна',
    "occupation": "Льотчик-Випробувач, Політичний Діяч",
    "military_rank": "Генерал-майор Авіації",
    "achievements": "Перший і єдиний космонавт незалежної України, Народний депутат України 4-го скликання (2002—2006), Народний Посол України, Герой України (1997), кавалер ордена «За заслуги» III ступеня (2011), кавалер ордена «За мужність» (1998), Почесний громадянин міста Чернівці, Генерал-майор Збройних Сил України, Президент Аерокосмічного товариства України, радник Прем'єр-міністра України та Голови Державного космічного агентства України, радник та помічник Президента України з питань авіації і космонавтики, Почесний доктор Чернівецького Національного університету імені Ю. Федьковича, Удостоєний медалі «За космічний політ» (1997)"}
    ]
    exploress2_list = [
    {
    "id": 2,
    "name": "Ніл Олден Армстронг",
    "birthdate": "5 серпня 1930",
    "birthplace": "Вопаканета, штат Огайо, США",
    "deathdate": "25 серпня 2012",
    "occupation": "військово-морський льотчик ВМС США і астронавт",
    "notable_achievements": "Командир «Аполлона 11», перший землянин, який ступив на поверхню Місяця (20-21 липня 1969), Нагороджений Золотою медаллю Конгресу (2009)"}
    ]
    exploress3_list = [   
    {
    "id": 3,
    "name": "Роберт Генбері Браун",
    "birthdate": "31 серпня 1916",
    "deathdate": "16 січня 2002",
    "nationality": "англо-австралійський",
    "occupation": "астроном і фізик",
    "memberships": "член Лондонського королівського товариства (1960) і Австралійської АН (1967)",
    "education": "Брайтонський технічний коледж й коледж Ситі-енд-Гілдз (Лондон)",
    "career": "Освіту здобув у Брайтонському технічному коледжі й коледжі Ситі-енд-Гілдз (Лондон). У 1936—1947 займався радіотехнічними дослідженнями в різних британських військових відомствах, в 1949—1963 працював у Манчестерському університеті (з 1960 — професор радіоастрономії). З 1964 — професор астрономії Сіднейського університету.",
    "research": "Наукові дослідження належать до радіоастрономії. У обсерваторії Джодрелл-бенк Манчестерського університету провів спостереження багатьох джерел космічного радіовипромінювання. Спільно з К. Гезардом в 1950 вперше виявив радіовипромінювання нормальної галактики (M31 в сузір'ї Андромеди); показав, що повне випромінювання M31 порівнянне за величиною з випромінюванням нашої Галактики, яка належить до того ж типу галактик. Відкрив і вивчив радіовипромінювання інших нормальних галактик. Ототожнив декілька дискретних джерел радіовипромінювання з пекулярними галактиками і залишками найновіших зірок. Спільно з Р. Дженнісоном і М. Дас Гупта запропонував новий інтерферометричний метод вимірювання розмірів протяжних радіоджерел і визначив кутові розміри деяких з них (1952). Розробив спільно з Р. К. Твіссом теорію оптичного інтерферометра інтенсивностей для вимірювання кутових діаметрів зірок. У 1956 в обсерваторії Джодрелл-бенк побудував інтерферометр інтенсивностей з дзеркалами діаметром 154 см, потім в обсерваторії Наррабрі (Новий Південний Уельс) — інтерферометр інтенсивностей з дзеркалами діаметром 6,6 м. За допомогою першого інтерферометра був успішно зміряний діаметр Сіріуса, за допомогою другого зміряні діаметри кількох десятків найяскравіших гарячих зірок, а також визначені їхні поверхневі температури і тим самим уточнена шкала температур гарячих зірок.",
    "presidency": "Президент Міжнародного астрономічного союзу (1982—1985)",
    "awards": "Премія ім. Хольвека Французького фізичного товариства (1959), медаль А.С.Еддінгтона Лондонського королівського астрономічного товариства (1968), медаль Г'юза Лондонського королівського товариства (1971), Премія ім. Лайла Австралійської АН (1971)"
    }
    ]

    return render_template('spaceexplorers.html', spaceexplorers_list = exploress_list, spaceexplorers2_list = exploress2_list, spaceexplorers3_list = exploress3_list)

# Сторінка з фактами про космос
@app.route('/facts')
def facts():
    facts_list = [

    {
        'id': 1,
        'title': 'Чорна діра в центрі галактики',
        'description': 'Більшість галактик, включаючи нашу Млечну дорогу, мають в центрі супермасивні чорні діри. Чорна діра у центрі нашої галактики важить близько 4 мільйонів разів більше, ніж Сонце.'
    },
    {
        'id': 2,
        'title': 'Космічні подорожі',
        'description': 'Наразі існують плани для подорожей на Марс, а багато приватних компаній, таких як SpaceX і Blue Origin, активно розробляють технології для комерційних космічних подорожей.'
    },
    {
        'id': 3,
        'title': 'Безпека на орбіті',
        'description': 'Збільшення кількості супутників та інших об\'єктів на орбіті призводить до проблеми космічного сміття. Навколо Землі рухається велика кількість великих і малих об\'єктів, що може створити загрозу для майбутніх космічних місій.'
    },
    {
        'id': 4,
        'title': 'Таємниці темряви',
        'description': 'Близько 95% всього універсуму складається з темної енергії та темної матерії, які ще не були повністю зрозумілі для вчених. Це є однією з величезних таємниць сучасної астрофізики.'
    },
    {
        'id': 5,
        'title': 'Золота плита Voyager',
        'description': 'Кожен з двох космічних апаратів Voyager, запущених у 1977 році, має "Золоту плиту" з аудіозаписами та зображеннями землян, призначеними для інших розумних цивілізацій, які можуть знайти ці апарати у майбутньому.'
    },
    {
        'id': 6,
        'title': 'Загадкові радіосигнали',
        'description': 'Феномен швидких радіо спалахів (FRB) - коротких, сильних радіосигналів, які приходять з космосу - залишається загадковим. Джерела цих сигналів досі залишаються невідомими.'
    },
    {
        'id': 7,
        'title': 'Догатки',
        'description': 'Це лише кілька прикладів, і космос є неймовірною та заворожуєючою темою з багатою історією досліджень та відкриттів.'
    }
]
    facts2_list = [
    {
        'id': 1,
        'title': 'Різноманітність зіркових типів',
        'description': 'Зірки можуть відрізнятися за розміром, температурою, яскравістю і характером світіння. Вони класифікуються за спектральним класом, де розрізняються від гарячих і яскравих зір, таких як спектральний клас O, до менш гарячих і тьмяних, таких як спектральний клас M.'
    },
    {
        'id': 2,
        'title': 'Відстань і розміри',
        'description': 'Відстань до зір величезна, і їхні розміри також можуть бути дуже великими. Для вимірювання використовують такі одиниці, як парсек (приблизно 3.26 світлових років) і сонячний радіус.'
    },
    {
        'id': 3,
        'title': 'Спалахи та вибухи',
        'description': 'Деякі зірки проймають різноманітні фази життя, включаючи спалахи та вибухи. Наприклад, супернові - це вибухи, що супроводжують кінцеву стадію життя деяких зір. Вони можуть видавати таку велику кількість енергії, що тимчасово перевищують яскравість всього галактичного ядра.'
    },
    {
        'id': 4,
        'title': 'Системи множинних зір',
        'description': 'Багато зір мають супутників або є частинами багатозіркових систем. Такі системи можуть бути дуже складними і включати зірки різних типів та розмірів, які взаємодіють між собою.'
    },
    {
        'id': 5,
        'title': 'Еволюція зір',
        'description': 'Зірки проходять через різні етапи свого життя, залежно від їхньої маси. Цей цикл включає стадії, такі як зоряне облако, протозіря, головну послідовність, червоний гігант (або супергігант), а потім можливу смерть в результаті спалаху чи вибуху.'
    },
    {
        'id': 6,
        'title': 'Сонячна система',
        'description': 'Наша власна Сонячна система - одна з багатьох зірок у галактиці Млечний Шлях. Сонце - типова зірка середнього розміру, і вивчення його допомагає нам краще розуміти зіркову астрономію загалом.'
    },
    {
        'id': 7,
        'title': 'Світлові роки і час',
        'description': 'Відстані в космосі вимірюються у світлових роках - відстань, яку світло подолає протягом одного року. Це поняття допомагає уявити величезний масштаб всесвіту.'
    }
]
    facts3_list = [
    {
        'id': 1,
        'title': 'Виникнення чорних дір',
        'description': 'Чорні діри формуються в результаті гравітаційного занурення масивних зір або коли дві нейтронні зірки зливаються під час процесу супернової вибуху.'
    },
    {
        'id': 2,
        'title': 'Гравітаційний засмоктувач',
        'description': 'Одна з основних характеристик чорних дір - вони володіють потужним гравітаційним засмоктувачем. Якщо об\'єкт потрапляє в область подій чорної діри (межа, за яку ніщо не може вийти), він стає неповоротлим.'
    },
    {
        'id': 3,
        'title': 'Область подій і горизонт подій',
        'description': 'Границя чорної діри, за яку ніщо не може вийти, називається областю подій. Границя цієї області - горизонт подій.'
    },
    {
        'id': 4,
        'title': 'Типи чорних дір',
        'description': 'Існують три основних типи чорних дір: масивні, середні і сверхмасивні.'
    },
    {
        'id': 5,
        'title': 'Час біля чорних дір',
        'description': 'За час біля чорних дір гравітаційне поле сповільнює час, а тому для спостерігача, який опинився близько до чорної діри, час пройде повільніше, ніж для спостерігача в іншому місці.'
    },
    {
        'id': 6,
        'title': 'Харчування чорних дір',
        'description': 'Чорні діри можуть "харчуватися" газом, пилом та навіть зірками, утворюючи диск акреціїї, який видає значну кількість енергії у вигляді рентгенівського випромінювання.'
    },
    {
        'id': 7,
        'title': 'Дослідження чорних дір',
        'description': 'Нові технології та обсерваторії, такі як Event Horizon Telescope, намагаються здійснити перше фотографування горизонту подій чорної діри.'
    }
]

    return render_template('facts.html', facts=facts_list, facts2=facts2_list, facts3=facts3_list)

sun_description = (
    "Сонце - центральна зірка нашої Сонячної системи. "
    "Воно складається головним чином з гарячої плазми, водню та гелію, які горять в його ядрі за рахунок ядерних реакцій. "
    "Сонце генерує величезну кількість енергії, яка випромінюється у всіх напрямках і підтримує життя на Землі. "
    "Воно також має магнітне поле, яке впливає на планети та інші об'єкти в Сонячній системі. "
    "Сонце є об'єктом вивчення для вчених у всьому світі, і його дослідження допомагає зрозуміти різноманітні аспекти астрофізики та космології."
)
mercury_description = (
    "Меркурій - перша планета від Сонця в Сонячній системі та найменша планета в нашій системі. "
    "Вона є найближчою до Сонця та найшвидшою планетою, яка обертається навколо нього. "
    "Меркурій відомий своєю великою температурною різницею, оскільки він немає атмосфери, яка б зберігала тепло, "
    "і його поверхня нагрівається до дуже високих температур під час денної половини та охолоджується вночі. "
    "Поверхня Меркурія має багато кратерів від ударів метеоритів із-за відсутності атмосфери, що могла б захистити його. "
    "Вона також має кратери, які виникли внаслідок внутрішніх сейсмічних активностей. "
    "Хоча Меркурій був вивчений земними телескопами ще з давніх часів, "
    "повний опис його поверхні та особливостей став доступний завдяки космічним місіям, таким як місія MESSENGER (Mercury Surface, Space Environment, Geochemistry, and Ranging), яка дозволила докладно вивчити цю планету."
)
venus_description = (
    "Венера - друга планета від Сонця в Сонячній системі та найближча планета до Землі. "
    "Вона є найсприятливішою для спостережень з Землі та є найяскравішим об'єктом на небі після Сонця та Місяця. "
    "Венера має дуже густу атмосферу, яка складається головним чином з вуглекислого газу, "
    "та зберігає тепло, утримуючи температуру поверхні на рівні близько 462°C, що робить її найспекотнішою планетою в Сонячній системі. "
    "Поверхня Венери має багато вулканів, гір та великих равнин, а також кратерів, але вони рідко зустрічаються через активну геологічну діяльність. "
    "Хоча Венера має схожий розмір та масу з Землею, її атмосфера та поверхня значно відрізняються від Землі. "
    "Венера є об'єктом інтенсивного наукового дослідження, зокрема завдяки космічним місіям, таким як місія Venera (російсько-радянська програма для дослідження Венери) та місія Venus Express (європейська космічна місія для дослідження атмосфери та поверхні Венери)."
)
earth_description = (
        "Земля - третя планета від Сонця у Сонячній системі та єдиний відомий об'єкт у Всесвіті, де відоме існування життя. "
        "Вона є однією з чотирьох терестріальних планет (планет з кам'яною поверхнею) та єдиним небесним тілом, де відомо існування води у трьох станах: рідкому, твердому та газоподібному. "
        "Земля також володіє атмосферою, яка складається переважно з азоту та кисню, з додаванням інших газів, таких як аргон, вуглекислий газ та водяна пара. "
        "Поверхня Землі складається з суходолу та водного покриву, що міститься у великих океанах і морях. "
        "Її географія різноманітна, включаючи гори, рівнини, пустелі, ліси та полярні льодовики. "
        "Земля має один природний супутник, відомий як Місяць, який впливає на течії океанів і припливи. "
        "Земля обертається навколо своєї вісі та орбітує навколо Сонця, що призводить до формування доби та року. "
        "Вона також нахилена щодо своєї орбіти, що призводить до зміни пори року на різних півкулях. "
        "Цей нахил також відповідає за сезонні зміни у кліматі. "
        "Земля є домом для мільярдів видів життя, включаючи людей, тварин та рослин. "
        "Вона також є єдиним об'єктом у Всесвіті, який ми вивчаємо безпосередньо та активно досліджуємо, використовуючи наукові методи та космічні місії."
)
mon_description = (
"Місяць - це природний супутник планети Земля. Він є одним з найяскравіших обєктів на небі та грає важливу роль у багатьох аспектах нашого життя. Ось деяка інформація про місяць:"
"1. Рух: Місяць обертається навколо Землі з періодом приблизно 27.3 днів. Також, він обертається навколо своєї вісі з таким самим періодом, тому ми бачимо тільки одну сторону місяця."
"2. Фази: Місяць має різні фази, такі як новий місяць, перша чверть, повний місяць та остання чверть. Ці фази змінюються через цикл, який відомий як місячний цикл."
"3. Гравітаційний вплив: Місяць впливає на припливи та відпливи у водах океанів, створюючи приблизно 12-годинні цикли. Цей вплив також відомий як приливно-відливні сили."
"4. Вплив на живі організми: Місяць може мати вплив на живі організми, включаючи рослини та тварин, хоча точний механізм цього впливу залишається предметом дебатів серед науковців."
"5. Дослідження: Місяць був обєктом інтенсивного дослідження, включаючи місії NASA та інших космічних агентств. Люди вперше висадилися на Місяці в 1969 році під час місії Аполлон-11."
"6. Супутник для астрономічних досліджень: Місяць служить важливою платформою для астрономічних досліджень та спостережень, оскільки його віддаленість від Землі та відсутність атмосфери дозволяють здійснювати спостереження з високою роздільною здатністю."
"7. Культурний і символічний значення: Місяць має велике культурне значення у багатьох народів. Він часто використовується в мистецтві, поезії, літературі та релігії як символ містики, романтики та таємниці."
"Це лише деякі аспекти місяця, які варто врахувати. Цей натхненний обєкт продовжує захоплювати та вивчати нас протягом цілого життя."
)
mars_description = (
    "Марс - четверта планета від Сонця в Сонячній системі та друга за розміром планета після Юпітера. "
    "Він відомий також як Червона планета через свій вид червоного кольору, що походить від окислення заліза на його поверхні. "
    "Поверхня Марса має горбистий ландшафт, що складається з гір, долин, кратерів та великих піщаних дюн. "
    "Марс має атмосферу, але вона дуже тонка, складається переважно з вуглекислого газу з невеликою кількістю азоту та аргона. "
    "Температури на Марсі можуть бути дуже холодними, досягаючи максимуму близько -87°C. "
    "Марс має два природних супутники, Фобос та Деймос, які є найбільшими з маленьких тіл, що оточують планету. "
    "Хоча Марс зараз виглядає як засушлива та незаселена планета, де можливе існування мікробного життя, "
    "дослідження науковими місіями показали, що в минулому на Марсі може бути було рідке водоймище та більш теплий клімат. "
    "Марс привертає великий інтерес дослідників як потенційне місце для майбутнього колонізації та дослідження космосу."
)
jupiter_description = (
    "Юпітер - п'ята планета від Сонця в Сонячній системі та найбільша серед всіх планет. "
    "Він відомий своєю величезною масою та розмірами, а також має потужну атмосферу та багато супутників. "
    "Юпітер складається переважно з газу та рідкого металу, а його атмосфера складається головним чином з водню та гелію. "
    "Поверхня Юпітера не має чіткого межового шару з атмосферою, але складається з різних газових рівнів, включаючи області хмар, "
    "які включають в себе великі чергові смуги та вихори. "
    "Юпітер має численні супутники, найбільш відомий з яких - Європа, Ганімед, Каллісто та Іо. "
    "Ці супутники мають власні унікальні характеристики, такі як можливе наявність океанів під льодовою поверхнею на Європі або активні вулкани на Іо. "
    "Юпітер також має кілька об'єктів, які можна назвати кільцями, але вони набагато тонші та менш помітні, ніж кільця Сатурна. "
    "Ця планета є предметом інтенсивного дослідження завдяки космічним місіям, таким як місія Galileo та місія Juno, "
    "які допомогли вивчити атмосферу, магнітне поле та структуру Юпітера."
)
saturn_description = (
    "Сатурн - шоста планета від Сонця в Сонячній системі та друга за розміром планета після Юпітера. "
    "Він відомий своїми видимими кільцями, що складаються з дрібних часток льоду та каміння, які обертаються навколо планети. "
    "Сатурн має товсту атмосферу, головним чином складену з водню та гелію, а його поверхня складається з газу та рідини. "
    "Кільця Сатурна складаються з тисячі різних кільцевих частин, які розташовані на різних відстанях від планети. "
    "Ці кільця можуть бути різних ширин і стали предметом детальних досліджень. "
    "Сатурн також має численні супутники, найбільш відомий з яких - Титан, який є єдиним супутником у Сонячній системі з атмосферою. "
    "Сатурн був досліджений різними космічними місіями, такими як місія Cassini-Huygens, яка надала детальну інформацію про структуру кілець, атмосферу та супутників планети."
)
uranus_description = (
    "Уран - сьома планета від Сонця в Сонячній системі та третя за розміром газовий гігант. "
    "Він відомий своєю наклоненою віссю обертання, що призводить до того, що він обертається " 
    "на боку, тобто ось обертання планети практично паралельна плоскості орбіти. "
    "Уран має хмарну атмосферу, головним чином складену з водню та гелію, а також метану, який надає йому характерний блакитний колір. "
    "Поверхня Урана вкрита льодовими кристалами та газоподібними океанами, а його ядро складається з каміння та льоду. "
    "Уран має 27 відомих супутників, найбільш відомий з яких - Титанія. "
    "Ця планета була досліджена місією Voyager 2, яка надала значну кількість інформації про структуру, атмосферу та супутників Урана."
)
neptune_description = (
    "Нептун - восьма планета від Сонця в Сонячній системі та четверта серед газових гігантів. "
    "Він відомий своєю неймовірно великою швидкістю вітру, що досягає буревію на поверхні. "
    "Нептун має схожу атмосферу з Ураном, головним чином складену з водню, гелію та метану, який надає йому характерний синій колір. "
    "Поверхня Нептуна є газоподібною та складається з льодових кристалів та аміаку. "
    "У південній півкулі Нептуна знаходиться великий темний плямистий плям, який називається. "
    "Нептун має 14 відомих супутників, найбільш відомий з яких - Тритон. "
    "Ця планета була досліджена місією Voyager 2, яка надала значну кількість інформації про структуру, атмосферу та супутників Нептуна."
)
pluto_description = (
    "Плутон - карликова планета у нашій Сонячній системі. "
    "Він є одним з об'єктів Койперового поясу і періодично перетинає орбіту Нептуна. "
    "Плутон складається переважно з пористого мінерального матеріалу, а також льоду води та метану. "
    "Він має найбільший супутник у системі, який називається Харон. "
    "Плутон і Харон знаходяться в дуже нестабільній гравітаційній взаємодії, і їх орбіти не є круговими. "
    "Плутон був детально вивчений космічним апаратом New Horizons у 2015 році, що дозволило отримати детальну інформацію про його поверхню та атмосферу."
)
sedna_description = (
    "Седна - це об'єкт, який знаходиться на зовнішній межі нашої Сонячної системи. "
    "Він є одним з найдалекіших від Сонця об'єктів, відомих в наш час. "
    "Седна має овальну орбіту з дуже великою ексцентриситетом, що призводить до того, що вона може перебувати на великій відстані від Сонця на своїй орбіті. "
    "Відкриття Седни викликало широкий інтерес, оскільки воно свідчить про існування можливих досі не відомих об'єктів на периферії нашої Сонячної системи."
)

image_list = [(1,"https://watchers.news/wp-content/uploads/2016/02/sdo_6th_year_sun_2015_f.jpg", "Сонце", sun_description),
              (2,"https://preview.free3d.com/img/2015/10/2272980235332880368/zqnrepta.jpg", "Меркурій", mercury_description),
              (3,"https://fons.pibig.info/uploads/posts/2023-06/thumbs/1687274049_fons-pibig-info-p-oboi-venera-krasivo-10.jpg", "Венера",venus_description),
              (4,"https://searchthisweb.com/wallpaper/thumb1000/main1000_earth_7680x4320_ejea5.jpg", "Земля", earth_description),
              (5,"https://images4.alphacoders.com/101/1011715.jpg", "Міяць", mon_description),
              (6,"https://searchthisweb.com/wallpaper/thumb1000/main1000_mars_3840x2160_jk1uo.jpg", "Марс", mars_description),
              (7,"https://preview.free3d.com/img/2015/10/2272856533563868502/9qi4sllu.jpg", "Юпітер", jupiter_description),
              (8,"https://preview.free3d.com/img/2017/09/2272956915455624279/qvrtkgyz.jpg", "Сатурн", saturn_description),
              (9,"https://kartin.papik.pro/uploads/posts/2023-07/thumbs/1688612504_kartin-papik-pro-p-kartinki-planeta-neptun-v-kosmose-14.jpg", "Нептун", neptune_description),
              (10,"https://i.obozrevatel.com/news/2020/6/4/unnamed.jpg", "Уран", uranus_description ),
              (11,"https://img.freepik.com/premium-photo/pluto-a-planet-in-the-solar-system_297535-4532.jpg", "Плутон", pluto_description),
              (12,"https://kite.od.ua/wp-content/uploads/scale_1200-10.png", "Седна", sedna_description ),]

# Сторінка з галереєю
@app.route('/gallery')
def gallery():
    # Тут ви можете додати логіку для отримання списку зображень
    return render_template('gallery.html', images=image_list)
# Сторінка з галереєю
@app.route('/gallery/<id>')
def item_gallery(id):
    for item in image_list:
        if str ( item [0] ) == id:
            return render_template('image_description.html', item=item)
# Сторінка "Про нас"
@app.route('/about')
def about():
    return render_template('about.html')


if __name__ == '__main__':
    app.run(debug=True, host="0.0.0.0")
